Revit 2024 API
UIThemeManager.DefaultTheme Property
 The default theme.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit the replacement is CurrentTheme property.")]
public static UITheme DefaultTheme { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit the replacement is CurrentTheme property.")> _
Public Shared Property DefaultTheme As UITheme
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2024 and may be removed in a future version of Revit the replacement is CurrentTheme property.")]
public:
static property UITheme DefaultTheme {
	UITheme get ();
	void set (UITheme value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
UIThemeManager Class
Autodesk.Revit.UI Namespace